814k31/BNRaggingRightsFirmware/nrf5-ble-tutorial-advertising/main.c
/* Copyright (c) 2014 Nordic Semiconductor. All Rights Reserved.
 *
 * The information contained herein is property of Nordic Semiconductor ASA.
 * Terms and conditions of usage are described in detail in NORDIC
 * SEMICONDUCTOR STANDARD SOFTWARE LICENSE AGREEMENT.
 *
 * Licensees are granted free, non-transferable use of the information. NO
 * WARRANTY of ANY KIND is provided. This heading must NOT be removed from
 * the file.
 *
 */
// #ifndef PCA10040_H
// #define PCA10040_H

// // LEDs definitions for PCA10040
// #define LEDS_NUMBER    4

// #define LED_START      17
// #define LED_1          17
// #define LED_2          18
// #define LED_3          19
// #define LED_4          20
// #define LED_STOP       20

// #define LEDS_LIST { LED_1, LED_2, LED_3, LED_4 }

// #define BSP_LED_0      LED_1
// #define BSP_LED_1      LED_2
// #define BSP_LED_2      LED_3
// #define BSP_LED_3      LED_4

// #define BSP_LED_0_MASK (1<<BSP_LED_0)
// #define BSP_LED_1_MASK (1<<BSP_LED_1)
// #define BSP_LED_2_MASK (1<<BSP_LED_2)
// #define BSP_LED_3_MASK (1<<BSP_LED_3)

// #define LEDS_MASK      (BSP_LED_0_MASK | BSP_LED_1_MASK | BSP_LED_2_MASK | BSP_LED_3_MASK)
// /* all LEDs are lit when GPIO is low */
// #define LEDS_INV_MASK  LEDS_MASK

// #define BUTTONS_NUMBER 4

// #define BUTTON_START   13
// #define BUTTON_1       13
// #define BUTTON_2       14
// #define BUTTON_3       15
// #define BUTTON_4       16
// #define BUTTON_STOP    16
// #define BUTTON_PULL    NRF_GPIO_PIN_PULLUP

// #define BUTTONS_LIST { BUTTON_1, BUTTON_2, BUTTON_3, BUTTON_4 }

// #define BSP_BUTTON_0   BUTTON_1
// #define BSP_BUTTON_1   BUTTON_2
// #define BSP_BUTTON_2   BUTTON_3
// #define BSP_BUTTON_3   BUTTON_4

// #define BSP_BUTTON_0_MASK (1<<BSP_BUTTON_0)
// #define BSP_BUTTON_1_MASK (1<<BSP_BUTTON_1)
// #define BSP_BUTTON_2_MASK (1<<BSP_BUTTON_2)
// #define BSP_BUTTON_3_MASK (1<<BSP_BUTTON_3)

// #define BUTTONS_MASK   0x001E0000

// #define RX_PIN_NUMBER  8
// #define TX_PIN_NUMBER  6
// #define CTS_PIN_NUMBER 7
// #define RTS_PIN_NUMBER 5
// #define HWFC           true

// #define SPIS_MISO_PIN   28  // SPI MISO signal.
// #define SPIS_CSN_PIN    12  // SPI CSN signal.
// #define SPIS_MOSI_PIN   25  // SPI MOSI signal.
// #define SPIS_SCK_PIN    29  // SPI SCK signal.

// #define SPIM0_SCK_PIN   29  // SPI clock GPIO pin number.
// #define SPIM0_MOSI_PIN  25  // SPI Master Out Slave In GPIO pin number.
// #define SPIM0_MISO_PIN  28  // SPI Master In Slave Out GPIO pin number.
// #define SPIM0_SS_PIN    12  // SPI Slave Select GPIO pin number.

// #define SPIM1_SCK_PIN   2   // SPI clock GPIO pin number.
// #define SPIM1_MOSI_PIN  3   // SPI Master Out Slave In GPIO pin number.
// #define SPIM1_MISO_PIN  4   // SPI Master In Slave Out GPIO pin number.
// #define SPIM1_SS_PIN    5   // SPI Slave Select GPIO pin number.

// #define SPIM2_SCK_PIN   12  // SPI clock GPIO pin number.
// #define SPIM2_MOSI_PIN  13  // SPI Master Out Slave In GPIO pin number.
// #define SPIM2_MISO_PIN  14  // SPI Master In Slave Out GPIO pin number.
// #define SPIM2_SS_PIN    15  // SPI Slave Select GPIO pin number.

// // serialization APPLICATION board - temp. setup for running serialized MEMU tests
// #define SER_APP_RX_PIN              23    // UART RX pin number.
// #define SER_APP_TX_PIN              24    // UART TX pin number.
// #define SER_APP_CTS_PIN             2     // UART Clear To Send pin number.
// #define SER_APP_RTS_PIN             25    // UART Request To Send pin number.

// #define SER_APP_SPIM0_SCK_PIN       27     // SPI clock GPIO pin number.
// #define SER_APP_SPIM0_MOSI_PIN      2      // SPI Master Out Slave In GPIO pin number
// #define SER_APP_SPIM0_MISO_PIN      26     // SPI Master In Slave Out GPIO pin number
// #define SER_APP_SPIM0_SS_PIN        23     // SPI Slave Select GPIO pin number
// #define SER_APP_SPIM0_RDY_PIN       25     // SPI READY GPIO pin number
// #define SER_APP_SPIM0_REQ_PIN       24     // SPI REQUEST GPIO pin number

// // serialization CONNECTIVITY board
// #define SER_CON_RX_PIN              24    // UART RX pin number.
// #define SER_CON_TX_PIN              23    // UART TX pin number.
// #define SER_CON_CTS_PIN             25    // UART Clear To Send pin number. Not used if HWFC is set to false.
// #define SER_CON_RTS_PIN             2     // UART Request To Send pin number. Not used if HWFC is set to false.


// #define SER_CON_SPIS_SCK_PIN        27    // SPI SCK signal.
// #define SER_CON_SPIS_MOSI_PIN       2     // SPI MOSI signal.
// #define SER_CON_SPIS_MISO_PIN       26    // SPI MISO signal.
// #define SER_CON_SPIS_CSN_PIN        23    // SPI CSN signal.
// #define SER_CON_SPIS_RDY_PIN        25    // SPI READY GPIO pin number.
// #define SER_CON_SPIS_REQ_PIN        24    // SPI REQUEST GPIO pin number.

// #define SER_CONN_CHIP_RESET_PIN     11    // Pin used to reset connectivity chip


// // Arduino board mappings
// #define ARDUINO_SCL_PIN             27    // SCL signal pin
// #define ARDUINO_SDA_PIN             26    // SDA signal pin
// #define ARDUINO_AREF_PIN            2     // Aref pin
// #define ARDUINO_13_PIN              25    // Digital pin 13
// #define ARDUINO_12_PIN              24    // Digital pin 12
// #define ARDUINO_11_PIN              23    // Digital pin 11
// #define ARDUINO_10_PIN              22    // Digital pin 10
// #define ARDUINO_9_PIN               20    // Digital pin 9
// #define ARDUINO_8_PIN               19    // Digital pin 8

// #define ARDUINO_7_PIN               18    // Digital pin 7
// #define ARDUINO_6_PIN               17    // Digital pin 6
// #define ARDUINO_5_PIN               16    // Digital pin 5
// #define ARDUINO_4_PIN               15    // Digital pin 4
// #define ARDUINO_3_PIN               14    // Digital pin 3
// #define ARDUINO_2_PIN               13    // Digital pin 2
// #define ARDUINO_1_PIN               12    // Digital pin 1
// #define ARDUINO_0_PIN               11    // Digital pin 0

// #define ARDUINO_A0_PIN              3     // Analog channel 0
// #define ARDUINO_A1_PIN              4     // Analog channel 1
// #define ARDUINO_A2_PIN              28    // Analog channel 2
// #define ARDUINO_A3_PIN              29    // Analog channel 3
// #define ARDUINO_A4_PIN              30    // Analog channel 4
// #define ARDUINO_A5_PIN              31    // Analog channel 5

// // Low frequency clock source to be used by the SoftDevice
/*#define NRF_CLOCK_LFCLKSRC      {.source        = NRF_CLOCK_LF_SRC_XTAL,            \
                                 .rc_ctiv       = 0,                                \
                                 .rc_temp_ctiv  = 0,                                \
                                 .xtal_accuracy = NRF_CLOCK_LF_XTAL_ACCURACY_20_PPM}*/

// #endif // PCA10040_H












/* Copyright (c) 2014 Nordic Semiconductor. All Rights Reserved.
 *
 * The information contained herein is property of Nordic Semiconductor ASA.
 * Terms and conditions of usage are described in detail in NORDIC
 * SEMICONDUCTOR STANDARD SOFTWARE LICENSE AGREEMENT.
 *
 * Licensees are granted free, non-transferable use of the information. NO
 * WARRANTY of ANY KIND is provided. This heading must NOT be removed from
 * the file.
 *
 */

/** @file
 *
 * @defgroup ble_sdk_app_template_main main.c
 * @{
 * @ingroup ble_sdk_app_template
 * @brief Template project main file.
 *
 * This file contains a template for creating a new application. It has the code necessary to wakeup
 * from button, advertise, get a connection restart advertising on disconnect and if no new
 * connection created go back to system-off mode.
 * It can easily be used as a starting point for creating a new application, the comments identified
 * with 'YOUR_JOB' indicates where and how you can customize.
 */

#include <stdbool.h>
#include <stdint.h>
#include <string.h>

#include "nordic_common.h"
#include "nrf.h"
#include "app_error.h"
#include "ble.h"
#include "ble_hci.h"
#include "ble_srv_common.h"
#include "ble_advdata.h"
#include "ble_advertising.h"
#include "ble_conn_params.h"
// #include "boards.h"
#include "softdevice_handler.h"
#include "app_timer.h"
#include "device_manager.h"
#include "pstorage.h"
#include "app_trace.h"
// #include "bsp.h"
// #include "bsp_btn_ble.h"
#include "sensorsim.h"
#include "nrf_gpio.h"
#include "ble_hci.h"
#include "ble_advdata.h"
#include "ble_advertising.h"
#include "nrf_delay.h"


#define IS_SRVC_CHANGED_CHARACT_PRESENT  1                                          /**< Include or not the service_changed characteristic. if not enabled, the server's database cannot be changed for the lifetime of the device*/

#define CENTRAL_LINK_COUNT               0                                          /**< Number of central links used by the application. When changing this number remember to adjust the RAM settings*/
#define PERIPHERAL_LINK_COUNT            1                                          /**< Number of peripheral links used by the application. When changing this number remember to adjust the RAM settings*/

